Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་སོ་སོར་རྟོག་པ་ན་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དག་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས་ཆེད་དུ་རྗོད་པ་འདི་ལ་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་དོ། །
en: “As he correctly contemplated in this way, eight hundred million gods of the pure abodes gathered in formation in the sky before him. Three times they proclaimed the following:

source: ཀྱེ་མ་སེང་གེ་སེང་གེ་ཆེ། །སེམས་ཅན་སེང་གེ་འཇིགས་པ་མེད། །
en: “ ‘Ah lion, great lion, Fearless lion of sentient beings,

source: སེང་གེ་བསམ་པ་རྣམ་པར་སེམས། །འདྲེན་པ་སེང་གེར་འགྱུར་བ་ཡིན། །
en: With a lion’s thought and attention You have become a lion guide.

source: བར་སྣང་འདི་ལ་འཁོད་པ་ཡི། །ལྷ་ནི་བྱེ་བ་བརྒྱད་ཅུ་དག །
en: “ ‘Eight hundred million gods Have gathered here in the sky.

source: འཇིགས་མེད་སེང་གེའི་སྒྲ་སྒྲོགས་ལ། །ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་བྱེད། །
en: With joined palms we pay homage To he who roars with a fearless lion’s voice.’

source: ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་ཞིང་། །དཔག་ཏུ་མེད་པ་ཐམས་ཅད་དུ། །
en: “ ‘Throughout the boundless buddha realms In all the ten directions

source: ཁྱོད་ཀྱི་བློ་ཡི་སྣང་བ་བཏང་། །ཁྱོད་ཀྱིས་ཞིང་ཀུན་སྦྱངས་པ་ཡིན། །
en: You cast your mind’s light And thus you have cultivated all realms.

source: གླང་པོ་ཆེན་པོ་ཅང་ཤེས་པ། །ཐུབ་པར་དཀའ་ཞིང་བསྙེན་པར་དཀའ། །
en: “ ‘A great elephant of the finest breed, Hard to subdue and hard to serve,

source: སེམས་ཅན་ཀུན་གྱི་འདྲེན་པ་སྟེ། །རྐང་གཉིས་དམ་པ་མཆོག་ཏུ་འགྱུར། །
en: You are the guide of all beings, Supreme among all who walk on two feet.

source: ཇི་ལྟར་དེ་དག་སྔོན་སངས་རྒྱས། །འདྲེན་མངོན་ཡང་དག་སངས་རྒྱས་པ། །
en: “ ‘Just like the buddhas of the past, The guides who have truly awoken,

source: འདྲེན་པ་ཁྱོད་ལ་ཡོད་པས་ན། །གང་ཟག་མཆོག་ནི་སངས་རྒྱས་འཐོབ། །
en: Guide, you possess the very same qualities And so, supreme person, you will become a buddha.’

source: དེའི་ཚེ་དེ་སེམས་མཉམ་པར་བཞག་པས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “While remaining in equipoise, the sage wondered,

source: འདིས་ཇི་ཙམ་ཞིག་སྣང་བར་གྱུར་སྙམ་མོ། །
en: ‘What is this light?’

source: དེ་ལ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་དེ་དག་གིས་སྨྲས་པ།
en: “The gods of the pure abodes then told him,

source: གྲོགས་པོ་ཁྱོད་ཀྱི་སྣང་བ་འདིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་དག་སྣང་བ་བྱས་པར་གྱུར་ཏོ། །
en: ‘Friend, your own light illumines ineffably many buddha realms throughout the ten directions.’

source: དེའི་ཚེ་དེའི་ལྷ་དེ་དག་གི་སྒྲ་ཐོས་ནས་ཇི་ལྟ་བུའི་དགེ་བའི་རྩ་བའི་ཤུགས་ཐོབ་པ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བའི་ཤུགས་ཀྱིས་ནམ་མཁའ་ལ་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མངོན་པར་འཕགས་སོ། །
en: “As he heard the gods’ words, the sage acquired a particular root of virtue, and by the power of that root of virtue he now ascended into the sky up to the height of seven palm trees.

source: ནམ་མཁའ་ལ་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མངོན་པར་འཕགས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཁ་ཅིག་ནི་སྐུ་བཙས།
en: Seated there in the sky at the height of seven palm trees, he now saw blessed buddhas throughout the universes of the ten directions. Some were taking birth,

source: ཁ་ཅིག་ནི་གོམ་པ་བདུན་འདོར།
en: others were taking the seven steps,

source: ཁ་ཅིག་ནི་མངོན་པར་འབྱུང་།
en: others were becoming renunciants,

source: ཁ་ཅིག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: others were awakening to unsurpassed and perfect awakening,

source: ཁ་ཅིག་ནི་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: others were turning the wheel of the unsurpassed Dharma,

source: ཁ་ཅིག་ནི་སྐུ་ཚེའི་འདུ་བྱེད་འདོར།
en: others where relinquishing the physical body,

source: ཁ་ཅིག་ནི་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་
en: and others again were passing beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: མཐོང་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱི་ཆོས་སྟོན་པ་ཡང་ཐོས་ནས།
en: The sage saw all those blessed buddhas, and he also heard their Dharma teachings.

source: དེས་བར་སྣང་ལ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་དག་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་སྨྲས་པ།
en: Then he spoke the following verses to the gods of the pure abodes:

source: གྲོགས་པོ་སྔོན་གྱི་འཁོར་བ་ཡི། །མུ་ནི་འཚལ་བར་མ་གྱུར་པས། །
en: “ ‘Friends, when searching throughout the past We do not find any beginning of cyclic existence.

source: བདག་ཅག་རྒྱུད་འདི་སྐྱོ་བ་ཡིས། །བྱང་ཆུབ་ཞི་བ་ཡོངས་སུ་སྤངས། །
en: Sadly, our streams of being Have been bereft of the peace of awakening.

source: བྱང་ཆུབ་མཆོག་གི་དོན་གྱི་ཕྱིར། །བདག་ཅག་གོ་ཆ་འདི་ཡང་བགོ། །བསྐལ་པ་དག་ནི་གྲངས་མེད་པར། །བདག་ཅག་གོ་ནི་བགོ་བར་བྱ། །
en: “ ‘For the sake of supreme awakening We don this armor, Which we shall bear Throughout incalculable eons.

source: བར་སྣང་ལ་ནི་མངོན་སུམ་དུ། །སྙིང་བརྩེ་ལྡན་ཞིང་དོན་འདོད་པ། །སྔོན་གྱི་རྒྱལ་བ་དྲན་པ་ཡི། །བདག་གི་དྲུང་ན་ལྷ་འཁོད་པ། །
en: “ ‘Perceptible in the sky before me Are arrays of divine beings With loving hearts and true objectives, Recollecting the victorious ones of the past.

source: སངས་རྒྱས་ཆོས་ནི་ཉམས་དགའ་དང་། །ཅི་ཕྱིར་ཁྱེད་ཅག་འཇུག་མི་བྱེད། །
en: “ ‘The Dharma of the buddhas is delightful— Why do you not pursue it?

source: ཁྱེད་ཅག་གིས་ནི་ཅི་ཕྱིར་སྤངས། །
en: Why do you leave it aside?

source: རིག་བྱེད་ཤེས་ལ་དེ་སྨྲས་པ། །
en: This is the word of Knower of the Vedas.

source: སེམས་ཅན་རྣམས་ནི་ཐར་བའི་ཕྱིར། །བསྐལ་པ་བྱེ་བ་དཔག་མེད་ཅིང་། །བསྐལ་པ་དག་ནི་གྲངས་མེད་པར། །གོ་འདི་གང་ཡིན་བགོ་བར་བྱ། །
en: “ ‘For the sake of the liberation of all beings During unfathomable millions of ages, Throughout incalculable eons We shall bear this armor.

source: སངས་རྒྱས་དག་ནི་ཆོས་ཀྱི་ཕྱིར། །བདག་གིས་ལུས་དང་སྲོག་ལ་ཡང་། །ལྟོས་པ་མེད་པར་བྱས་ནས་སུ། །བདག་གིས་བརྩོན་འགྲུས་བརྩམ་པར་བྱ། །
en: “ ‘For the sake of the Dharma of the buddhas I will have no concern For my body and life, And instead rouse diligence.

source: འཇིག་རྟེན་འདི་ནི་མུན་པ་དང་། །མུན་ནག་ཐིབས་པོས་ཁེབས་པ་ཡིན། །
en: “ ‘The world is enveloped In darkness, dense darkness.

source: སངས་རྒྱས་དག་གི་ཆོས་ཀྱི་རྒྱུས། །སྣང་བ་དག་ནི་རབ་ཏུ་བྱ། །
en: With the Dharma of the buddhas as cause I shall let this light shine.

source: བདག་ཅག་བདག་ཉིད་བྱང་ཆུབ་ཏུ། །སངས་རྒྱས་སྤྱོད་ཡུལ་རྟོགས་བགྱིས་ནས། །
en: “ ‘Within our own awakening We realize the domain of the buddhas.

source: སྲོག་ཆགས་བདུད་ཀྱི་སྤྱོད་ཡུལ་གྱི། །ལམ་དུ་ཞུགས་པ་བདག་གིས་དགྲོལ། །
en: The beings bound to the domain of the māras We shall set on the path and liberate.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་རིག་བྱེད་ཤེས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Knower of the Vedas was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་རིག་བྱེད་ཤེས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Knower of the Vedas.

source: སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ངའི་སྣང་བས་རེག་པས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Due to my light innumerably many tens of thousands of beings became irreversible.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སྣང་བ་ལ་ལྷག་པར་མོས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood must develop special devotion for such light.

source: མཽད་གལ་གྱི་བུ་ངས་མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས། བདག་གིས་ཇི་ལྟར་བྱ་སྙམ་པའི་བར་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of the defilement of ignorance. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of the defilement of ignorance.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ལམ་དཀར་པོ་ལ་གནས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Traveler on the Path of Goodness.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ། དགེ་བའི་ཆོས་ཐམས་ཅད་དང་མཚུངས་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: This sage had great miraculous powers and splendor, had attained freedom from attachment to pleasures by means of the outer path, and he had accomplished the absorption that is equal to all virtuous qualities.

source: བྱང་ཆུབ་སེམས་དཔའ་ཅི་ཞིག་བསླབས་ན་དགེ་བའི་ཆོས་འདི་དང་མཚུངས་པར་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ངེས་པར་འབྱུང་སྙམ་མོ། །
en: ‘What must a bodhisattva train in to be certain to accomplish this absorption that is endowed with all virtuous qualities?

source: ཆོས་གང་བྱེད་པ་མེད་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ངེས་པར་འབྱུང་ངོ་། །
en: For that to happen the bodhisattva must achieve the absorption that does not act on any phenomenon.

source: ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་དང་བྲལ་བའི་ཕྱིར་བྱས་པ་མ་ཡིན་ནོ་སྙམ་ནས།
en: Because all phenomena are beyond creation; they have never been created.’

source: དེ་དྲན་པ་ཡང་དག་པར་ཤེས་པའི་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ་ཡུལ་རྒྱུ་ཞིང་ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་དང་བྲལ་བའི་ཕྱིར་བྱས་པ་མ་ཡིན་ནོ་ཞེས་ཆོས་དེ་དག་སྟོན་པར་བྱེད་དོ། །
en: “When he arose from his absorption of proper mindfulness, the sage began to travel throughout the universes in the ten directions, teaching, ‘Since all phenomena are beyond creation, they have never been created.’

source: དེའི་ཆོས་སྟོན་པ་དེ་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: Thus, as others heard his teaching of the Dharma, innumerably many tens of thousands of beings gained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ལམ་དཀར་པོ་ལ་གནས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Traveler on the Path of Goodness was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ལམ་དཀར་པོ་ལ་གནས་པར་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Traveler on the Path of Goodness.

source: ང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་རྒྱུ་ཞིང་ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་དང་བྲལ་བའི་ཕྱིར་བྱས་པ་མ་ཡིན་ནོ་ཞེས་བསྟན་པས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: I traveled throughout all those universes, bringing the message that because all phenomena are beyond creation, they have never been created. As they heard my teaching, innumerably many tens of thousands of beings gained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་བྱེད་པ་དང་བྲལ་བའི་ཕྱིར་བྱས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་འདུ་ཤེས་འདི་ཀུན་ཏུ་བསྟེན་པར་བྱ་ཞིང་བསྒོམ་པར་བྱ། མང་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must rely on, train in, and increase the understanding that because all phenomena are beyond creation, they have never been created.

source: མཽད་གལ་གྱི་བུ་ངས་མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of the defilement of ignorance. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of the defilement of ignorance.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་ཚད་མེད་བརྗོད་དུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཤེས་པ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless, countless, inconceivable, immeasurable, boundless, and inexpressible cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Unhindered Knowledge.

source: མཐུ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པའི་འདོད་ཆགས་དང་བྲལ་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀུན་མི་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: The sage had great miraculous powers and splendor, he had attained freedom from attachment to pleasures by means of the outer path, and he had accomplished the absorption known as not observing an essential nature of any sentient being.

source: དེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བ་རྟོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་ནས་བར་གྱི་བསྐལ་པ་ཉི་ཤུ་རྩ་བཞིར་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དག་ཀུན་ཏུ་བསྟེན་ཅིང་བསྒོམས་ཏེ
en: Once he had achieved the absorption known as realizing that all phenomena have no essential nature , he spent twenty-four intermediate eons relying on, training in, and increasing the bases of miraculous absorption.

source: མང་དུ་བྱས་པས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་རྡུལ་ཕྲ་མོ་སྙེད་དུ་རྒྱུ་ཞིང་ངོ་བོ་ཉིད་ཐམས་ཅད་མི་དམིགས་པའི་ཏིང་ངེ་འཛིན་སྟོན་པ་ན་དེ་བར་གྱི་བསྐལ་པ་ཉི་ཤུར་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མ་དེ་དག་ཏུ་སེམས་ཅན་ཁྲི་ཕྲག་བརྗོད་དུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: He then spent another twenty intermediate eons journeying throughout as many buddha realms as there are subtle particles in inexpressibly many buddha realms. All the while he taught sentient beings the absorption of not observing any essential nature. Thus he established innumerably many tens of thousands of beings in the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤེས་པ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Unhindered Knowledge was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤེས་པ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Unhindered Knowledge.

source: ངས་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དེ་དག་ཀུན་ཏུ་བསྟེན་ཅིང་བསྒོམས་ཏེ་
en: I relied on, trained in, and increased the bases of miraculous absorption and

source: མང་དུ་བྱས་པས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་སེམས་ཅན་ཁྲི་ཕྲག་བརྗོད་དུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: I traveled throughout numerous buddha realms, establishing innumerably many tens of thousands of beings in the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལ་རབ་ཏུ་གནས་པར་བྱ་ཞིང་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་གནས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must abide by the four bases of miraculous absorption, and they must accept that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Maudgalyāyana, bodhisattva great beings who accept that phenomena are unborn will quickly awaken to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་ངས་མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of the defilement of ignorance. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the defilement of ignorance.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་སྒྲིབ་པ་མེད་པར་ཤེས་པ་མཐོང་བ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Seer of Knowledge Free from Obscuration,

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་ལ་གཟི་བརྗིད་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: who possessed great miraculous powers and splendor, and had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་དབེན་པར་སོང་སྟེ་ནང་དུ་ཡང་དག་བཞག་པ་དང་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་སྐྱེས་ཏེ་ཆོས་ནི་གང་ཡིན་ཆོས་ཀྱི་སྒྲིབ་པ་ནི་གང་ཡིན་སྙམ་མོ།
en: The sage went into solitude and, while thus practicing meditation, he asked himself, ‘What are phenomena, and what are the factors that obscure phenomena?’

source: ཆོས་ནི་གང་ཡང་མེད་ལ། ཆོས་ཀྱི་སྒྲིབ་པ་ཡང་གང་ཡང་མེད་དོ། །
en: ‘There are no phenomena at all, nor are there any factors that obscure them.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ཏེ།
en: Because all phenomena are devoid of essential nature.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ནི་ནམ་མཁའི་སྒྲིབ་པ་མི་བྱེད་དེ།
en: For example, space does not obscure space.

source: ནམ་མཁའ་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར་རོ་སྙམ་ནས།
en: Because space is devoid of essential nature.’

source: དེ་དྲན་པ་ཡང་དག་པར་ཤེས་པའི་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ།
en: “Arising from his absorption of proper mindfulness, the sage proclaimed,

source: གྲོགས་པོ་དག་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར།
en: ‘Friends, no phenomenon has any essential nature!

source: ཆོས་གང་ཞིག་ཆོས་གང་ལ་ཡང་སྒྲིབ་པ་མེད་དོ་ཞེས་སྒྲ་བསྒྲགས་སོ། །
en: Therefore, there are no factors that obscure phenomena at all!’

source: དེའི་སྒྲ་དེ་ཐོས་ནས། གྲོགས་པོ་དག་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ནོ་ཞེས་ཕྱོགས་བཞིའི་རླུང་གིས་ཚོགས་པ་མེད་པར་ཁྱེར་རོ། །
en: As the sage’s words were spoken, the winds of the four directions took them and carried them everywhere.

source: དེའི་སྒྲ་དེ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཐོས་ནས། ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ། །
en: When they heard that message, innumerably many tens of thousands of beings attained the absorption in which all phenomena lack essential nature.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་སྒྲིབ་པ་མེད་པར་ཤེས་པ་མཐོང་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Seer of Knowledge Free from Obscuration was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་སྒྲིབ་པ་མེད་པར་ཤེས་པ་མཐོང་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the sage Seer of Knowledge Free from Obscuration.

source: ངས་སྒྲ་བསྒྲགས་པ་དེ་ཕྱོགས་བཞིའི་རླུང་གིས་ཐོགས་པ་མེད་པར་ཁྱེར་བ་སེམས་ཅན་འཁོད་པ་དེ་དག་གིས་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ནོ་ཞེས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: My words were carried everywhere by the winds of the four directions and, upon hearing my message that all phenomena are devoid of essential nature, beings gained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood must pursue the absence of essential nature in all phenomena.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Thus spoke the Blessed One.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point venerable Maudgalyāyana said,

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་ཟབ་ཅིང་རྒྱ་ཆེ་བ་ངོ་མཚར་ལགས་ཏེ།
en: “Blessed One, it is amazing how profound and vast the wisdom of the blessed buddhas is!

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན། དེ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ལགས། ཇི་ཙམ་དུ་སངས་རྒྱས་ཀྱི་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་དེ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེའི་སེམས་ཅན་འདུལ་བར་མཛད་དོ། །
en: As I understand the meaning of what the Blessed One has conveyed here, the buddha realm of the Buddha extends as far as his buddha knowledge, which tames beings in every single buddha realm.

source: བཅོམ་ལྡན་འདས་ཀྱི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བསོད་ནམས་དོན་དུ་གཉེར་བ་བསོད་ནམས་ཚོལ་བ་གང་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་རྡུལ་ཕྲ་མོའི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེས་ཡོངས་སུ་བཀང་སྟེ
en: “A noble son or daughter of the Blessed One in pursuit and search of merit may fill universes as numerous as the atoms of ineffably many buddha realms with jewels,

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་རྡུལ་ཕྲ་མོའི་རྡུལ་སྙེད་ཀྱི་བསྐལ་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས།
en: and they may offer such jewels to the blessed ones for as many eons as there are atoms in innumerably many buddha realms.

source: གང་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡེ་ཤེས་རྒྱས་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཅིང་ཀུན་ཆུབ་པར་བགྱིས་ལ་འཆང་ཞིང་གཞན་དག་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏམ།
en: Yet their accumulation of merit cannot match what is achieved by retaining, mastering, upholding, and explaining to others this Dharma teaching, which unfolds the wisdom of the Blessed One.

source: ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེའཆང་བ་འདི་ནི་དེ་བས་བསོད་ནམས་ཚོགས་མང་དུ་སོགས་ལགས་སོ། །
en: Even just writing it down and carrying it will create greater merit.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to Mahā­maudgalyāyana:

source: མཽད་གལ་གྱི་བུ་ཆེན་པོ་དེ་དེ་བཞིན་ཏེ།
en: “Thus it is, Mahā­maudgalyāyana.

source: དེ་ནི་ཁྱོད་ཀྱིས་ཡིན་ནོ། །
en: What you say is true.

source: མཽད་གལ་གྱི་བུ་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ།
en: Maudgalyāyana, think of it this way.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་རྡུལ་ཕྲ་མོའི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སེམས་ཅན་དག་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་དངོས་པོ་ཉིད་ཐོབ་སྟེབླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། དེ་བཞིན་གཤེགས་པ་སོ་སོའི་དབུ་དེ་སྙེད་དུ་གྱུར།
en: Imagine that all beings in as many worlds in the ten directions as there are atoms within ineffably many buddha realms all at once were to become human beings. If these beings were to awaken to unsurpassed and perfect buddhahood, then each of these thus-gone ones would have as many heads.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་རེ་རེའི་དབུ་ཇི་སྙེད་པ་ལ་ཞལ་དེ་སྙེད་དུ་གྱུར། དེ་དག་རེ་རེའི་ཞལ་ཇི་སྙེད་པ་ལ་ལྗགས་དེ་སྙེད་དུ་གྱུར།
en: Each of these blessed buddhas would then have as many mouths as there were heads, and as many tongues as there were mouths.

source: དེ་ཅིའི་ཕྱིར་ན།
en: How can this be?

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་དཔག་ཏུ་མེད་པ་དང་ལྡན།
en: Because, Maudgalyāyana, the Thus-Gone One possesses immeasurable wisdom,

source: ཡེ་ཤེས་དཔག་གིས་མི་ལང་བ་དང་ལྡན།
en: unfathomable wisdom,

source: ཡེ་ཤེས་གྲངས་མེད་པ་དང་ལྡན།
en: incalculable wisdom,

source: ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན།
en: inconceivable wisdom,

source: ཡེ་ཤེས་གཞལ་དུ་མེད་པ་དང་ལྡན།
en: limitless wisdom, and

source: ཡེ་ཤེས་གཞལ་གྱིས་མི་ལང་བ་དང་ལྡན།
en: inestimable wisdom.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཡེ་ཤེས་བརྗོད་དུ་མེད་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: Maudgalyāyana, the thus-gone, worthy, perfect Buddha possesses inexpressible wisdom.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ། །
en: When the Blessed One had spoken, venerable Mahā­maudgalyāyana rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་རྒྱས་པའི་མདོ་སྡེ་རིན་པོ་ཆེའི་མཐར་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the Great Vehicle sūtra, “ The Precious Discourse on the Blessed One’s Extensive Wisdom That Leads to Infinite Certainty .”

source: རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་བར་མ་དང་། ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྙིང་པོས་བསྒྱུར།
en: This was translated by the Indian preceptor, Prajñāvarman, and the translator, venerable Yeshe Nyingpo.
